In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

In [3]:
df

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    951     18   John
1  2023-01-02       B   West    206     60   Mary
2  2023-01-03       C  North    538     43    Bob
3  2023-01-04       D  South    160     87  Alice
4  2023-01-05       A   East    709     77   John
5  2023-01-06       B   West    757     31   Mary
6  2023-01-07       C  North    369     65    Bob
7  2023-01-08       D  South    165     86  Alice
8  2023-01-09       A   East    933     78   John
9  2023-01-10       B   West    508     58   Mary
10 2023-01-11       C  North    272     95    Bob
11 2023-01-12       D  South    688     35  Alice
12 2023-01-13       A   East    467     47   John
13 2023-01-14       B   West    997     17   Mary
14 2023-01-15       C  North    406     61    Bob
15 2023-01-16       D  South    475     33  Alice
16 2023-01-17       A   East    583     63   John
17 2023-01-18       B   West    169     46   Mary
18 2023-01-19       C  North    907     66    Bob
19 2023-01-20       D  South    768     38  Alice

In [4]:
df['Month'] = df['Date'].dt.month_name()

In [5]:
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    951     18   John  January      Q1
1  2023-01-02       B   West    206     60   Mary  January      Q1
2  2023-01-03       C  North    538     43    Bob  January      Q1
3  2023-01-04       D  South    160     87  Alice  January      Q1
4  2023-01-05       A   East    709     77   John  January      Q1
5  2023-01-06       B   West    757     31   Mary  January      Q1
6  2023-01-07       C  North    369     65    Bob  January      Q1
7  2023-01-08       D  South    165     86  Alice  January      Q1
8  2023-01-09       A   East    933     78   John  January      Q1
9  2023-01-10       B   West    508     58   Mary  January      Q1
10 2023-01-11       C  North    272     95    Bob  January      Q1
11 2023-01-12       D  South    688     35  Alice  January      Q1
12 2023-01-13       A   East    467     47   John  January      Q1
13 2023-01-14       B   West    997     17   Mary  January      Q1
14 2023-01-15       C  North    406     61    Bob  January      Q1
15 2023-01-16       D  South    475     33  Alice  January      Q1
16 2023-01-17       A   East    583     63   John  January      Q1
17 2023-01-18       B   West    169     46   Mary  January      Q1
18 2023-01-19       C  North    907     66    Bob  January      Q1
19 2023-01-20       D  South    768     38  Alice  January      Q1

In [6]:
pd.pivot_table(df, values= 'Sales', index = 'Region', columns= 'Product', aggfunc='median')

Product      A      B      C      D
Region
East     709.0    NaN    NaN    NaN
North      NaN    NaN  406.0    NaN
South      NaN    NaN    NaN  475.0
West       NaN  508.0    NaN    NaN

In [7]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     728.6    NaN    NaN    NaN  56.6   NaN   NaN   NaN
North      NaN    NaN  498.4    NaN   NaN   NaN  66.0   NaN
South      NaN    NaN    NaN  451.2   NaN   NaN   NaN  55.8
West       NaN  527.4    NaN    NaN   NaN  42.4   NaN   NaN

CROSS TABS

In [8]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0